chore: move all documentation to root and remove docs folder
